In [1]:
import pandas as pd

In [2]:
data = {
    'Empleado': ['Juan','Ana','Pedro','Luis','Maria'],
    'Salario': [50000, 60000, 55000, 58000, 62000],
    'Anios_Experiencia': [5,7,6,8,9]
}
df = pd.DataFrame(data)
print("DataFrame Original:\n", df)

DataFrame Original:
   Empleado  Salario  Anios_Experiencia
0     Juan    50000                  5
1      Ana    60000                  7
2    Pedro    55000                  6
3     Luis    58000                  8
4    Maria    62000                  9

In [3]:
#realizar un ajuste de salarios con una funcion 
def calcular_salario_ajustado(row):
    salario = row['Salario']
    anios_experiencia = row['Anios_Experiencia']
    bono = 0.05 * anios_experiencia * salario
    salario_ajustado = salario + bono
    return salario_ajustado

df['Salario_Ajustado'] = df.apply(calcular_salario_ajustado, axis=1)
print("DataFrame con salario ajustado:\n", df)

DataFrame con salario ajustado:
   Empleado  Salario  Anios_Experiencia  Salario_Ajustado
0     Juan    50000                  5           62500.0
1      Ana    60000                  7           81000.0
2    Pedro    55000                  6           71500.0
3     Luis    58000                  8           81200.0
4    Maria    62000                  9           89900.0

In [5]:
#normalizar columnas
def normalizar(serie):
    return (serie - serie.mean()) / serie.std()

df[['Salario_Normalizado', 'Anios_Experiencia_Normalizado']] = df[['Salario', 'Anios_Experiencia']].apply(normalizar)
print("DataFrame con salarios y anios de experiencia normalizados:\n", df)

DataFrame con salarios y anios de experiencia normalizados:
   Empleado  Salario  Anios_Experiencia  Salario_Ajustado  Salario_Normalizado  \
0     Juan    50000                  5           62500.0            -1.492405
1      Ana    60000                  7           81000.0             0.639602
2    Pedro    55000                  6           71500.0            -0.426401
3     Luis    58000                  8           81200.0             0.213201
4    Maria    62000                  9           89900.0             1.066004

   Anios_Experiencia_Normalizado
0                      -1.264911
1                       0.000000
2                      -0.632456
3                       0.632456
4                       1.264911

In [6]:
#categorizacion de salarios
def categorizar_salario(salario):
    if salario > 60000:
        return 'Alto'
    elif salario > 55000:
        return 'Medio'
    else:
        return 'Bajo'

df['Categoria_Salario'] = df['Salario'].map(categorizar_salario)
print("DataFrame con categoria de salario:\n", df)

DataFrame con categoria de salario:
   Empleado  Salario  Anios_Experiencia  Salario_Ajustado  Salario_Normalizado  \
0     Juan    50000                  5           62500.0            -1.492405
1      Ana    60000                  7           81000.0             0.639602
2    Pedro    55000                  6           71500.0            -0.426401
3     Luis    58000                  8           81200.0             0.213201
4    Maria    62000                  9           89900.0             1.066004

   Anios_Experiencia_Normalizado Categoria_Salario
0                      -1.264911              Bajo
1                       0.000000             Medio
2                      -0.632456              Bajo
3                       0.632456             Medio
4                       1.264911              Alto

In [7]:
df

,Empleado,Salario,Anios_Experiencia,Salario_Ajustado,Salario_Normalizado,Anios_Experiencia_Normalizado,Categoria_Salario
0,Juan,50000,5,62500.0,-1.492405,-1.264911,Bajo
1,Ana,60000,7,81000.0,0.639602,0.000000,Medio
2,Pedro,55000,6,71500.0,-0.426401,-0.632456,Bajo
3,Luis,58000,8,81200.0,0.213201,0.632456,Medio
4,Maria,62000,9,89900.0,1.066004,1.264911,Alto

In [16]:
# Función para formatear un valor numérico en formato monetario
def formatear_valor(x):
    # Verificamos si el valor ingresado es un número (entero o decimal)
    if isinstance(x, (int, float)):
        # Si es un número, lo devolvemos como cadena con formato monetario:
        # - $ al inicio - Comas como separadores de miles - Dos decimales
        return f"${x:,.2f}"
     # Si no es un número, simplemente devolvemos el valor original sin cambios
    return x
# Llamada a la función con un número decimal
df_formateado = df.applymap(formatear_valor)
df_formateado

C:\Users\fach7\AppData\Local\Temp\ipykernel_6488\2876367261.py:11: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_formateado = df.applymap(formatear_valor)

,Empleado,Salario,Anios_Experiencia,Salario_Ajustado,Salario_Normalizado,Anios_Experiencia_Normalizado,Categoria_Salario
0,Juan,"$50,000.00",$5.00,"$62,500.00",$-1.49,$-1.26,Bajo
1,Ana,"$60,000.00",$7.00,"$81,000.00",$0.64,$0.00,Medio
2,Pedro,"$55,000.00",$6.00,"$71,500.00",$-0.43,$-0.63,Bajo
3,Luis,"$58,000.00",$8.00,"$81,200.00",$0.21,$0.63,Medio
4,Maria,"$62,000.00",$9.00,"$89,900.00",$1.07,$1.26,Alto